---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.CoolingSetPoint
source: html/63083e27-82a3-002b-ec31-d64bc3aff3ec.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.CoolingSetPoint Property

The cooling temperature set point in unit Kelvin (K).

## Syntax (C#)
```csharp
public double CoolingSetPoint { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: